#### Terraform Initialization ⚙️`success`

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/findnull/Nginx-Wordpress-AWS-Provision-CLI/runs/run-QvUoRVFvjmjajst8

Waiting for the plan to start...

Terraform v1.6.6
on linux_amd64
Initializing plugins and modules...
data.cloudflare_zone.get_zone_info: Refreshing...
data.cloudflare_zone.get_zone_info: Refresh complete after 1s [id=5205803830b737a6db6d69e81746d17e]
data.aws_ami.ubuntu: Refreshing...
data.aws_vpc.default: Refreshing...
data.aws_ami.ubuntu: Refresh complete after 1s [id=ami-06c4be2792f419b7b]
data.aws_vpc.default: Refresh complete after 2s [id=vpc-07698d914a73924ed]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_instance.vm_server will be created
  + resource "aws_instance" "vm_server" {
      + ami                                  = "ami-06c4be2792f419b7b"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = true
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "vm-key"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "App" = "Wordpress"
        }
      + tags_all                             = {
          + "App" = "Wordpress"
        }
      + tenancy                              = (known after apply)
      + user_data                            = "6c283d452e79b71accf207252d486d4218d3ec8d"
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)
    }

  # aws_key_pair.vm_key will be created
  + resource "aws_key_pair" "vm_key" {
      + arn             = (known after apply)
      + fingerprint     = (known after apply)
      + id              = (known after apply)
      + key_name        = "vm-key"
      + key_name_prefix = (known after apply)
      + key_pair_id     = (known after apply)
      + key_type        = (known after apply)
      + public_key      = (sensitive value)
      + tags_all        = (known after apply)
    }

  # aws_security_group.vm_security_group will be created
  + resource "aws_security_group" "vm_security_group" {
      + arn                    = (known after apply)
      + description            = "vm security group"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "vm-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = "vpc-07698d914a73924ed"
    }

  # aws_security_group_rule.engress[0] will be created
  + resource "aws_security_group_rule" "engress" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Port HTTP"
      + from_port                = 80
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "egress"
    }

  # aws_security_group_rule.engress[1] will be created
  + resource "aws_security_group_rule" "engress" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Port HTTPS"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "egress"
    }

  # aws_security_group_rule.ingress[0] will be created
  + resource "aws_security_group_rule" "ingress" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Port SSH"
      + from_port                = 5522
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 5522
      + type                     = "ingress"
    }

  # aws_security_group_rule.ingress[1] will be created
  + resource "aws_security_group_rule" "ingress" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Port HTTP"
      + from_port                = 80
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "ingress"
    }

  # aws_security_group_rule.ingress[2] will be created
  + resource "aws_security_group_rule" "ingress" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Port HTTPS"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # aws_security_group_rule.ingress[3] will be created
  + resource "aws_security_group_rule" "ingress" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Port needed for apt"
      + from_port                = 32768
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 65535
      + type                     = "ingress"
    }

  # cloudflare_record.domain_name will be created
  + resource "cloudflare_record" "domain_name" {
      + allow_overwrite = true
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = (sensitive value)
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = (known after apply)
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = "5205803830b737a6db6d69e81746d17e"
    }

Plan: 10 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + public_ip_ec2 = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

#### Terraform Apply 🚀`success`

<details><summary>Show Apply</summary>

```

terraform
Running apply in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will cancel the remote apply if it's still pending. If the apply started it
will stop streaming the logs, but will not stop the apply running remotely.

Preparing the remote apply...

To view this run in a browser, visit:
https://app.terraform.io/app/findnull/Nginx-Wordpress-AWS-Provision-CLI/runs/run-YKTKXe5iVomCbR8N

Waiting for the plan to start...

Terraform v1.6.6
on linux_amd64
Initializing plugins and modules...
data.cloudflare_zone.get_zone_info: Refreshing...
data.cloudflare_zone.get_zone_info: Refresh complete after 0s [id=5205803830b737a6db6d69e81746d17e]
data.aws_vpc.default: Refreshing...
data.aws_ami.ubuntu: Refreshing...
data.aws_ami.ubuntu: Refresh complete after 1s [id=ami-06c4be2792f419b7b]
data.aws_vpc.default: Refresh complete after 2s [id=vpc-07698d914a73924ed]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_instance.vm_server will be created
  + resource "aws_instance" "vm_server" {
      + ami                                  = "ami-06c4be2792f419b7b"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = true
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "vm-key"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "App" = "Wordpress"
        }
      + tags_all                             = {
          + "App" = "Wordpress"
        }
      + tenancy                              = (known after apply)
      + user_data                            = "6c283d452e79b71accf207252d486d4218d3ec8d"
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)
    }

  # aws_key_pair.vm_key will be created
  + resource "aws_key_pair" "vm_key" {
      + arn             = (known after apply)
      + fingerprint     = (known after apply)
      + id              = (known after apply)
      + key_name        = "vm-key"
      + key_name_prefix = (known after apply)
      + key_pair_id     = (known after apply)
      + key_type        = (known after apply)
      + public_key      = (sensitive value)
      + tags_all        = (known after apply)
    }

  # aws_security_group.vm_security_group will be created
  + resource "aws_security_group" "vm_security_group" {
      + arn                    = (known after apply)
      + description            = "vm security group"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "vm-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = "vpc-07698d914a73924ed"
    }

  # aws_security_group_rule.engress[0] will be created
  + resource "aws_security_group_rule" "engress" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Port HTTP"
      + from_port                = 80
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "egress"
    }

  # aws_security_group_rule.engress[1] will be created
  + resource "aws_security_group_rule" "engress" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Port HTTPS"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "egress"
    }

  # aws_security_group_rule.ingress[0] will be created
  + resource "aws_security_group_rule" "ingress" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Port SSH"
      + from_port                = 5522
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 5522
      + type                     = "ingress"
    }

  # aws_security_group_rule.ingress[1] will be created
  + resource "aws_security_group_rule" "ingress" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Port HTTP"
      + from_port                = 80
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "ingress"
    }

  # aws_security_group_rule.ingress[2] will be created
  + resource "aws_security_group_rule" "ingress" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Port HTTPS"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # aws_security_group_rule.ingress[3] will be created
  + resource "aws_security_group_rule" "ingress" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Port needed for apt"
      + from_port                = 32768
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 65535
      + type                     = "ingress"
    }

  # cloudflare_record.domain_name will be created
  + resource "cloudflare_record" "domain_name" {
      + allow_overwrite = true
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = (sensitive value)
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = (known after apply)
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = "5205803830b737a6db6d69e81746d17e"
    }

Plan: 10 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + public_ip_ec2 = (known after apply)

aws_key_pair.vm_key: Creating...
aws_security_group.vm_security_group: Creating...
aws_key_pair.vm_key: Creation complete after 1s [id=vm-key]
aws_security_group.vm_security_group: Creation complete after 4s [id=sg-0c0933771f406b712]
aws_security_group_rule.engress[1]: Creating...
aws_security_group_rule.engress[0]: Creating...
aws_security_group_rule.ingress[1]: Creating...
aws_security_group_rule.ingress[0]: Creating...
aws_security_group_rule.ingress[3]: Creating...
aws_security_group_rule.ingress[2]: Creating...
aws_instance.vm_server: Creating...
aws_security_group_rule.engress[1]: Creation complete after 1s [id=sgrule-4002307602]
aws_security_group_rule.ingress[1]: Creation complete after 2s [id=sgrule-3715452874]
aws_security_group_rule.ingress[0]: Creation complete after 3s [id=sgrule-2822074091]
aws_security_group_rule.engress[0]: Creation complete after 4s [id=sgrule-1927583289]
aws_security_group_rule.ingress[3]: Creation complete after 6s [id=sgrule-1157104109]
aws_security_group_rule.ingress[2]: Creation complete after 7s [id=sgrule-1901452354]
aws_instance.vm_server: Still creating... [10s elapsed]
aws_instance.vm_server: Still creating... [20s elapsed]
aws_instance.vm_server: Still creating... [30s elapsed]
aws_instance.vm_server: Creation complete after 35s [id=i-05afa179bbfe27215]
cloudflare_record.domain_name: Creating...
cloudflare_record.domain_name: Creation complete after 0s [id=0003edd73a1390e7cd1b174052359df2]

Apply complete! Resources: 10 added, 0 changed, 0 destroyed.

Outputs:
public_ip_ec2 = "18.143.108.60"

```

</details>

*Pusher: @nizarakbarm, Action: `pull_request`, Workflow: `CI Provision`*